In [6]:
import os
import pandas as pd

onedrive_path = os.path.abspath("D:/OneDrive - Singapore Management University/datasets")
netflix_movie_titles = os.path.join(onedrive_path, "netflix", "movie_titles.csv") # from
titles_path = os.path.join(onedrive_path, "netflix-cornac", "movie_titles.csv") # to

   item  year                          name
0     1  2003               Dinosaur Planet
1     2  2004    Isle of Man TT 2004 Review
2     3  1997                     Character
3     4  1994  Paula Abdul's Get Up & Dance
4     5  2004      The Rise and Fall of ECW

In [14]:
# overwrite with corrected data

item = []
year = []
name = []

movies_missing_year = {'4388': '2002', '4794': '2002', '7241': '2002', '10782': '1974', '15918': '1999', '16678': '1994', '17667': '1999'}

with open(netflix_movie_titles, 'r', encoding='latin1') as f:
    for line in f:
        # Split the line using commas
        fields = line.strip().split(',', maxsplit=2)

        if fields[1] == 'NULL':
            # print(line)
            fields[1] = movies_missing_year[fields[0]]

        item.append(int(fields[0]))
        year.append(int(fields[1]))
        name.append(fields[2])

df_titles = pd.DataFrame({'item': item, 'year': year, 'name':name})
df_titles.head()

   item  year                          name
0     1  2003               Dinosaur Planet
1     2  2004    Isle of Man TT 2004 Review
2     3  1997                     Character
3     4  1994  Paula Abdul's Get Up & Dance
4     5  2004      The Rise and Fall of ECW

In [15]:
df_titles.shape

(17770, 3)

In [16]:
df_titles.isnull().sum()

item    0
year    0
name    0
dtype: int64

In [17]:
df_titles.isna().sum()

item    0
year    0
name    0
dtype: int64

In [20]:
df_titles.to_csv(path_or_buf=titles_path, index=False, header=False)

   item  year                          name
0     1  2003               Dinosaur Planet
1     2  2004    Isle of Man TT 2004 Review
2     3  1997                     Character
3     4  1994  Paula Abdul's Get Up & Dance
4     5  2004      The Rise and Fall of ECW